// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B. 
int Num1 = new int();
int Num2 = new int();
Console.WriteLine("Введите число");
Num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите число");
Num2 = Convert.ToInt32(Console.ReadLine());
int FinishPow = 1;
int i = 1;

for (i = 0; i < Num2; i = i + 1)
{
    FinishPow  = Num2 * Ind;
}
Console.WriteLine(FinishPow );
